const SOL = [[1,"傳說的開始","伝説のはじまり",1,1.5,2,3],[2,"熱情的國家","情熱の国",1,1.5,2,3],[3,"葡萄糖胺沙漠","グルコサミン砂漠",1,1.5,2,3],[4,"貓咪們渡海","猫ども海を渡る",1,1.5,2,3],[5,"凝視著貓眼石","見つめてキャッツアイ",1,1.5,2,3],[6,"西方街道","ウエスタン街道",1,1.5,2,3],[7,"鮪魚海域","マグロ海域",1,1.5,2,3],[8,"竹子島","バンブー島",1,1.5,2,3],[9,"黏糊糊的鐘乳洞","ぷにぷに鍾乳洞",1,1.5,2,3],[10,"瓦魯肯諾火山","ボルケーノ火山",1,1.5,2,3],[11,"千里之道","千里の道",1,1.5,2,3],[12,"鹹魚要塞","アオ・ザ・カナ",1,1.5,2,3],[13,"軍艦島","軍艦島",1,1.5,2,3],[14,"貓咪磨爪的走廊","つめとぎの廊下",1,1.5,2,3],[15,"帕德嫩神殿","パルテノン神殿",1,1.5,2,2],[16,"退潮的海水浴場","ずんどこ海水浴場",1,1.5,2,2],[17,"惡魔島","アルカトラズ島",1,1.5,2,2],[18,"越獄隧道","脱獄トンネル",1,1.5,1.7,1.5],[19,"卡彭監獄","カポネの監獄",1,1.5,1.7,1.4],[20,"絲綢之路","シルクロード",1,1.4,1.6,1.4],[21,"通向黑暗的地下道","闇へと続く地下道",1,1.3,1.5,1.3],[22,"魔王的豪宅","魔王の豪邸",1,1.2,1.4,1.3],[23,"終焉宣告之夜","終わりを告げる夜",1,1.2,1.4,1.2],[24,"大混戰","バトルロワイアル",1,1.2,1.4,1.2],[25,"戰爭的傷痕","戦争のつめあと",1,1.2,1.4,1.1],[26,"污染海洋的壞人","海を汚す悪しき者",1,1.2,1.4,1.1],[27,"連接心身的東西","心と体、繋ぐもの",1,1.2,1.4,1],[28,"脆弱性和弱酸性","脆弱性と弱酸性",1,1.2,1.4,1],[29,"被引導的貓咪們","導かれしネコ達",1,1.2,1.4,1],[30,"黑暗的國際城市","暗黒コスモポリス",1,1.2,1.4,1],[31,"加拉・巴・哥","ガラ・パ・ゴス",1,1.2,1.4,1],[32,"岩海苔半島","岩海苔半島",1,1.2,1.4,1],[33,"惡羅斯聯邦","恐ろし連邦",1,1.2,1.4,1],[34,"亡者聚集之地","亡者の住まう地",1,1.2,1.4,1],[35,"孤島大瘟疫","絶島パンデミック",1,1.2,1.4,1],[36,"迪死你樂園","ふくろのねずみランド",1,1.2,1.3,1],[37,"豪來塢帝國","ハリーウッド帝国",1,1.2,1.3,1],[38,"小跟班海岸","こしぎんちゃくの浜辺",1,1.2,1.3,1],[39,"雲泥溫泉鄉","雲泥温泉郷",1,1.2,1.3,1],[40,"濃濃春色島","風待ちアイランド",1,1.2,1.3,1],[41,"IT地下墓穴","ITカタコンベ",1,1.2,1.3,1],[42,"怪展會之畫","変覧会の絵",1,1.2,1.3,1],[43,"22區","エリア２２",1,1.2,1.3,1],[44,"超越大草原","超越サバンナ",1,1.2,1.3,1],[45,"暴風雪車道","ブリザード自動車道",1,1.2,1.3,1],[46,"奇點村","シンギュラリティ村",1,1.2,1.3,1],[47,"最終大陸","オワーリ大陸",1,1.2,1.3,1],[48,"傳說的終點","伝説のおわり",1,1.2,1.3,1],[49,"古代研究所","古代研究所",1,1.2,1.3,1]];
const UL = [[1,"真・傳說的開始","真・伝説のはじまり",1,1.5,2,1],[2,"滿腹秘境","まんぷく秘境",1,1.5,2,1],[3,"冒險大森林","アドベン大森林",1,1.5,2,1],[4,"啪唰舊海道","じゃぶじゃぶ旧海道",1,1.5,2,1],[5,"旺旺灣","ワンワン湾",1,1.5,2,1],[6,"深淵窺視者","深淵を覗く者",1,1.5,2,1],[7,"異界城市","デスメガシティ",1,1.5,2,1],[8,"無法地帶的戒律","無法地帯のオキテ",1,1.5,2,1],[9,"唏哩嘩啦半島","パラリラ半島",1,1.5,2,1],[10,"貓咪們的政變","キャットクーデター",1,1.5,2,1],[11,"櫻桃島","桜んぼ島",1,1.4,1.8,1],[12,"打從魂魄的歸化","魂底からの帰化",1,1.4,1.8,1],[13,"絕滅海洋城","絶滅海洋タウン",1,1.4,1.8,1],[14,"流放渡假村","島流しリゾート",1,1.4,1.8,1],[15,"困惑的魔道路","まどいの魔道路",1,1.4,1.8,1],[16,"天界酒吧坊","天界バル横丁",1,1.4,1.8,1],[17,"澡堂大戰鬥","バトル銭湯",1,1.4,1.8,1],[18,"道地三連山","はえぬき三連山",1,1.4,1.8,1],[19,"海洋官邸","マリン官邸",1,1.4,1.8,1],[20,"寄生校園的惡意","学園に巣くう悪意",1,1.4,1.8,1],[21,"粉粿金礦","ところてん金鉱",1,1.4,1.8,1],[22,"酩酊煉鐵廠","酩酊製鉄所",1,1.3,1.7,1],[23,"被揭露的神殿之秘寶","暴かれし神殿の秘宝",1,1.3,1.7,1],[24,"帝國動亂","帝政エイジャナイカ",1,1.3,1.7,1],[25,"鋼鐵健身中心","鋼鉄スポーツジム",1,1.3,1.7,1],[26,"明星諸島","明星おきの島",1,1.3,1.7,1],[27,"沉睡森林的故事","眠れる森の何か",1,1.3,1.7,1],[28,"實驗島","ラボラ・トリ島",1,1.3,1.7,1],[29,"被遺忘的墳場","忘らるる墓所",1,1.3,1.7,1],[30,"宣告開始的早晨","始まりを告げる朝",1,1.3,1.7,1],[31,"幸運快樂寺院","ハッピーラッキー寺院",1,1.3,1.7,1],[32,"怪館戲院","キネマ怪館",1,1.3,1.7,1],[33,"多樣性都市","ダイバー都市",1,1.3,1.7,1],[34,"東南亞・巡禮","ナシゴ・レン",1,1.3,1.7,1],[35,"DNA果樹園","DNA果樹園",1,1.3,1.7,1],[36,"古代樹迷宮","古代樹の迷宮",1,1.3,1.7,1],[37,"阻擋者們的城堡","立ちはだかる者達の城",1,1.3,1.6,1],[38,"時空的彎曲","時空のゆがみ",1,1.3,1.5,1],[39,"大災難的開始","大厄災のはじまり",1,1.3,1.5,1],[40,"魔海域大港","魔海域ビックラ港",1,1.3,1.5,1],[41,"霹靂沸騰園","デッドヒートランド",1,1.3,1.5,1],[42,"愛情死巷子","バラ色の袋小路",1,1.3,1.5,1],[43,"千年獸的靈峰","千年獣の霊峰",1,1.3,1.5,1],[44,"月光自由沙灘","ムーディストビーチ",1,1.2,1.4,1],[45,"追逐貓咪的故鄉","猫追いしふるさと",1,1.2,1.4,1],[46,"海賊王商店街","海賊王商店街",1,1.2,1.4,1],[47,"虛虛實實的道路","真なる虚実を紡ぐ道",1,1.2,1.4,1],[48,"人類貓咪化計劃","人類ネコ化計画",1,1.1,1.2],[49,"古代神木","古代神樹",1,1.1,1.2]];
const ZL = [[1,"零之領域","ゼロフィールド",1],[2,"時空的盡頭","時空の最果て",1],[3,"烏龜烏龜翹盆地","バリチッチ盆地",1],[4,"烏魯魯布島滯留記","ウルルブ島滞在記",1],[5,"五告厲害新世界","新世界アリ＝エヘン",1],[6,"我們是海洋貓咪","われら海の猫",1],[7,"產生分歧的世界","対極にある真実",1],[8,"公合海灣的魔物","デシリットル湾の魔物",1],[9,"枯萎的沉思庭院","枯れた思考の庭",1],[10,"異界之路的另一頭","異空行路の先に",1],[11,"奇妙夕谷","イトコンバレー",1],[12,"點心桃花源","カルメ桃源郷",1],[13,"隱秘的摩爾摩島","隠されしモルモ島",1],[14,"","行楽地デラ・コスパ",1]];
const COLLAB = [["公主踢騎士Sweets","超魅惑公主","魅惑のプリンセス",1,1.5,2,3],["公主踢騎士Sweets","飛踢公主關卡","ケリ姫ステージ",1,1.5,2,3],["公主踢騎士Sweets","飛踢王國的教導","ケットバス王国の教え",1,1.5,1.7,2],["梅露可物語","對決！梅露可物語","対決！メルクストーリア",1,1.5,2,3],["梅露可物語","神秘的梅露可物語","神秘のメルクストーリア",1,1.5,2,3],["梅露可物語","地獄級梅露可物語","地獄のメルクストーリア",1,1.5,2,2],["梅露可物語","梅露可物語大反擊","逆襲のメルクストーリア",1,1.5,2,3],["梅露可物語","開眼的癒術士來襲！","開眼の癒術士襲来！",1],["梅露可物語","開眼的梅露可來襲！","開眼のメルク襲来！",1],["梅露可物語","開眼的推推來襲！","開眼のティティ襲来！",1],["活下去！曼波魚！","活下去！曼波魚！","生きろ！マンボウ！",1,2,3,4],["活下去！曼波魚！","3億條的夥伴都死掉了","３億匹の仲間はみな死んだ",1,2,3,3],["活下去！曼波魚！","歌后曼波魚崎A・Y・U 強襲！","ハマンボ崎あゆみ　強襲！",1],["消滅都市","消滅都市～失落的世界～","消滅都市 ～ロストへ～",1,2,3],["消滅都市","失去世界","失われし世界",1,2,3],["消滅都市","魂體之都","タマシイの都",1,2,3,1.5],["消滅都市","天上世界","天上の世界",1,2,3],["消滅都市","開眼的拓也與小雪","開眼のタクヤとユキ",1],["消滅都市","開眼的紅髮小雪貓來襲！","開眼の赤髪のゆきにゃん襲来！",1],["消滅都市","梅西耶 強襲！","メシエ 強襲！",1],["越南大戰DEFENSE","METAL SLUG DEFENSE 越南大戰","メタルスラッグディフェンス",1,1.5,2,3],["越南大戰DEFENSE","METAL SLUG DEFENSE 超級越南大戰","超メタルスラッグディフェンス",1,1.5,2,2],["越南大戰DEFENSE","","強襲！メタルスラッグ",1],["魔法少女小圓","成為魔法少女吧！","魔法少女になってよ",1,2,3],["魔法少女小圓","續・成為魔法少女吧！","続・魔法少女になってよ",1,2,3],["魔法少女小圓","魔女的結界～玫瑰園的魔女～","魔女の結界 ～薔薇園の魔女～",1,1.5,2],["魔法少女小圓","魔女的結界～零食的魔女～","魔女の結界 ～お菓子の魔女～",1,1.5,2],["魔法少女小圓","魔女的結界～箱的魔女～","魔女の結界 ～ハコの魔女～",1,1.5,2],["魔法少女小圓","胡桃鉗魔女","くるみ割りの魔女",1],["魔法少女小圓","魔女之夜","ワルプルギスの夜",1],["Crash Fever","ALICE的入口","ALICEの入り口",1,2,3],["Crash Fever","月夜古城","月夜のオールドシティ",1,2,3],["Crash Fever","女王失控","女王暴走",1,2,3],["劇場版 Fate/stay night","聖杯戰爭的緣起","聖杯戦争の始まり",1,2,3,3],["劇場版 Fate/stay night","激鬥！Saber來襲！","激闘！セイバー襲来！",1,2,3,3],["劇場版 Fate/stay night","激鬥！Lancer來襲！","激闘！ランサー襲来！",1,2,3,3],["劇場版 Fate/stay night","激鬥！Archer來襲！","激闘！アーチャー襲来！",1,2,3,3],["劇場版 Fate/stay night","激鬥！Rider來襲！","激闘！ライダー襲来！",1,2,3,3],["劇場版 Fate/stay night","大激鬥！Gilgamesh來襲！","大激闘！ギルガメッシュ襲来！",1,2,2.5,2.5],["劇場版 Fate/stay night","超激鬥！Saber Alter來襲！","超激闘！セイバーオルタ襲来！",1],["劇場版 Fate/stay night","Servant強襲！","サーヴァント強襲！",1],["實況野球","實況野球高校 2年級的夏天","パワフル高校2年の夏",1],["實況野球","來自沒問題博士的戰帖","ダイジョーブ博士の挑戦状",1],["實況野球","約會戰 貓塚花凜","デートステージ 猫塚かりん",1],["實況野球","約會戰 紺野美崎","デートステージ 紺野美崎",1],["實況野球","約會戰 虹谷彩理","デートステージ 虹谷彩理",1],["實況野球","約會戰 片桐戀","デートステージ 片桐恋",1],["新世紀福音戰士","出擊！EVANGELION","発進！エヴァンゲリオン",1,2,3,4],["新世紀福音戰士","決戰！屋島作戰","決戦！ヤシマ作戦",1,2,3,4],["新世紀福音戰士","第9使徒，來襲","第９の使徒、襲来",1,2,3,3],["新世紀福音戰士","第10使徒，來襲","第１０の使徒、襲来",1,2,3],["新世紀福音戰士","EVA第13號機，來襲","エヴァ第１３号機、襲来",1,2,3],["新世紀福音戰士","最終決戰　EVA第13號機","最終決戦　エヴァ第１３号機",1],["新世紀福音戰士","再見了，所有的貓咪。","さらば、全てのにゃんこ。",1],["新世紀福音戰士","使徒強襲","使徒強襲",1],["聖魔大戰","聖魔大戰勃發！","聖魔大戦勃発！",1,2,3,3],["聖魔大戰","聖魔大戰巧克力","ビックリマンチョコ",1],["聖魔大戰","對決！魔幻原型","対決！魔幻モデル",1,1.5,2],["聖魔大戰","覺醒！大和爆神","覚醒！ヤマト爆神",1,1.5,2],["聖魔大戰","惡魔軍 強襲 !","悪魔軍 強襲 !",1],["聖魔大戰","天使軍 強襲 !","天使軍 強襲 !",1],["快打旋風","快打旋風EASY","ストリートファイター EASY",1],["快打旋風","快打旋風NORMAL","ストリートファイター NORMAL",1],["快打旋風","快打旋風HARD","ストリートファイター HARD",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["快打旋風","New Challenger","New Challenger",1],["初音未來","初音未來","初音ミク",1,1.5,2],["初音未來","MIKU EXPO","MIKU EXPO",1,1.5,2],["初音未來","MIKU CHERRY","MIKU CHERRY",1,1.5,2],["初音未來","初音未來的誕生日！","初音ミクの誕生日！",1],["初音未來","SNOW MIKU","SNOW MIKU",1,1.5,2],["初音未來","強襲！電子歌姬","強襲！電子の歌姫",1],["初音未來","週末演唱會 第1天","週末ライブ DAY1",1],["初音未來","週末演唱會 第2天","週末ライブ DAY2",1],["亂馬1/2","波亂！天道道場","波乱！天道道場",1,1.5,2,3],["亂馬1/2","傳說的咒泉鄉","伝説の呪泉郷",1,1.5,2,3],["亂馬1/2","強襲！「亂馬１/２」","強襲！らんま1/2",1],["謎之兔","バースデープレゼント！","ナゾのウサギ登場!?",1],["城與龍","城與龍","城とドラゴン",1,1.5,2],["城與龍","固若金湯的城與龍","難攻不落の城とドラゴン",1,1.5,2,2.5],["城與龍","城與龍 VS 城與龍","城ドラ VS 城ドラ",1,1.15,1.3],["城與龍","開眼的城與龍","開眼の城とドラゴン",1],["城與龍","","強襲！城とドラゴン",1],["熱血高校","熱血！滾大球比賽","熱血！大玉転がし",1,1.5,2,3],["熱血高校","熱血！障礙物競走","熱血！障害物競走",1,1.5,2],["熱血高校","熱血！兩人三腳賽 低學年","熱血！二人三脚バトル  低学年",1],["熱血高校","熱血！兩人三腳賽 中學年","熱血！二人三脚バトル  中学年",1],["熱血高校","熱血！兩人三腳賽 高學年","熱血！二人三脚バトル  高学年",1],["熱血高校","熱血！大隊接力","熱血！リレー大会",1],["高捷少女","高雄捷運 紅線","高雄メトロ レッドライン",1,1.5,2],["高捷少女","高雄輕軌","高雄ライトレール",1,1.5,2],["高雄捷運x麻吉貓","高雄捷運 紅線","高雄MRT レッドライン",1,1.5,2],["高雄捷運x麻吉貓","高雄捷運 橘線","高雄MRT オレンジライン",1,1.5,2],["Hikakin ","飛踢王國的教導","ヒカキン降臨",1],["Hikakin ","飛踢王國的教導","開眼のヒカキン襲来！",1],["哥吉拉","決戰！巨大生物哥吉拉","決戦！巨大生物ゴジラ",1],["哥吉拉","哥吉拉對貓咪","ゴジラ対にゃんこ",1],["戽斗星球","戽斗星球","シャクレルプラネット",1,1.5,2],["戽斗星球","排行賽會場","ランキングの間",1],["賤萌熊","賤萌地激烈擺動白熊","キモ激しく動くクマ",1],["巧克力","貓奴大王","ＴＷその３",1],["巧克力","開眼巧克力來襲！","開眼のチョコレート襲来！",1],["蛋黃哥","軟爛中","ぐでぐでしてます",1,2,3],["蛋黃哥","反正遲早都會被吃","どうせ食べられるだけだし",1,2,3],["蛋黃哥","哥現在很忙","ぐでぐでしてて忙しい",1,2,3],["蛋黃哥","開眼蛋黃貓來襲！","開眼のぐでたまにゃんこ襲来！",1],["NEO菇菇栽培","來自菇菇的戰帖","なめこからの挑戦状",1],["魔物獵人大狩獵","バースデープレゼント！","モンハン大狩猟クエスト",1],["魔物獵人大狩獵","バースデープレゼント！","【緊急】モンハン大狩猟クエスト",1],["龍族撲克","バースデープレゼント！","ドラゴンポーカー",1,1.5],["小林幸子（歌謠貓）","大魔王降臨！？","ラスボス降臨!?",1],["小林幸子（歌謠貓）","開眼的歌謠貓來襲！","開眼の歌謡にゃんこ襲来！",1],["龍戰聯盟","バースデープレゼント！","ドラゴンリーグ",1,1.5],["氣志團","バースデープレゼント！","超激突！氣志團！！",1,1.5],["極道大戰爭","バースデープレゼント！","極道大戦争",1],["貓咪破壞者","バースデープレゼント！","突撃！キャットバスターズ",1],["PIKO太郎","PIKO太郎","ピコ太郎",1],["三原慧悟","追逐夢想男偶像","TWその２",1],["三原慧悟","開眼三原慧悟來襲！","開眼の三原慧悟襲来",1],["謎之兔","バースデープレゼント！","ナゾのウサギ登場!?",1],["新．日本英雄宇宙","","救出！にゃんこ仮面ライダー",1,1.5,2],["新．日本英雄宇宙","","救出！ゴジラにゃんこ",1,1.5,2],["新．日本英雄宇宙","","救出！エヴァンゲリオンにゃんこ",1,1.5,2],["新．日本英雄宇宙","","救出！ウルトラマンにゃんこ",1,1.5,2],["新．日本英雄宇宙","","シン・にゃんこ・ヒーローズ",1],["日清UFO拉麵","U.F.O.襲来！","U.F.O.襲来！",1,1.5,2],["像素英雄","シャクレルプラネット","ドットヒーローズ",1,1.5,2],["悠閒世界樹","バースデープレゼント！","神略！ゆるドラシル",1,1.5,2],["Google","來自初期的使者","黎明期からの使者",1,1.5,2],["Google","開眼Droid來襲！","開眼のドロイド襲来！",1],["境界觸發者","對決！玉狛第2的隊長","対決！玉狛第２のリーダー",1,1.5,2,3],["境界觸發者","對決！玉狛第2的王牌","対決！玉狛第２のエース",1,1.5,2,3],["境界觸發者","VS訓練用莫爾默德","VS訓練用モールモッド",1],["BitSummit Drift","協賛BitSummit記念！","協賛BitSummit記念！",1],["神魔之塔","以諾時代","以諾時代",1,1.5,2],["神魔之塔","對決！瘋頭！","対決！瘋頭！",1,1.5,2],["神魔之塔","強襲！神魔之塔","強襲！神魔の塔",1],["神劍闖江湖－明治劍客浪漫譚－","神劍闖江湖","るろうに剣心",1,1.5,2,2],["神劍闖江湖－明治劍客浪漫譚－","劍心・緋村拔刀齋","剣心・緋村抜刀斎",1,1.5],["神劍闖江湖－明治劍客浪漫譚－","從事打手的男人・相樂左之助","喧嘩の男・相楽左之助",1,1.5],["神劍闖江湖－明治劍客浪漫譚－","顯露敵意的狼・齋藤一","牙を剥く狼・斎藤一",1],["神劍闖江湖－明治劍客浪漫譚－","強襲！頭目・四乃森蒼紫","強襲！御頭・四乃森蒼紫",1],["神劍闖江湖－明治劍客浪漫譚－","","ランキングの間",1]];
const MONTHY = [[1,"新年快樂？","新年、あけました！おめっ...",1,1.5,2,3],[2,"被召喚的福！","召喚された福！",1,1.5,2,2.5],[3,"人偶架上的戰士們","雛壇の戦士達",1,1.5,2,3],[4,"春天來了!高校教師","春だよ！高校教師",1,1.5,2,3],[5,"相思病戀歌","コイの五月病",1,1.5,2,3],[6,"禁斷之妻","禁断の花嫁",1,1.5,2,3],[7,"因為夏天喵！","だって夏じゃニャーイ！",1,1.5,2,3],[8,"返鄉熱潮！","あの世からの帰省ラッシュ！",1,1.5,2,3],[9,"在鎮上看到的超強老人","町でみたすごい老人",1,1.5,2,3],[10,"秋天運動會！","秋だよ運動会！",1,1.5,2,3],[11,"勞動感謝特別活動！","勤労感謝スペシャル！",1,1.5,2,3],[12,"聖誕節居然來了！","なんとクリスマスが来た！",1,1.5,2,3]];
const STAR = [["月間活動全明星 特別紀念！","月イベントオールスターズ スペシャル記念！",1,1.5,2],["月間活動全明星 超強紀念！","月イベントオールスターズ ウルトラ記念！",1,1.5,2],["月間活動全明星 無敵紀念！","月イベントオールスターズ ミラクル記念！",1,1.5,2],["月間活動全明星 絕佳紀念！","月イベントオールスターズ ワンダフル記念！",1,1.5,2],["活動全明星關卡 卓越紀念！","イベントオールスターズ エクセレント記念！",1,1.5,2],["活動全明星 偉大紀念！","イベントオールスターズ グレイト記念！",1,1.5,2]];
const lang = {
	"processing": "處理中...",
	"loadingRecords": "載入中...",
	"paginate": {
		"first": "第一頁",
		"previous": "上一頁",
		"next": "下一頁",
		"last": "最後一頁"
	},
	"emptyTable": "目前沒有資料",
	"zeroRecords": "沒有符合的資料",
	"aria": {
		"sortAscending": "：升冪排列",
		"sortDescending": "：降冪排列"
	},
	"info": "顯示第 _START_ 至 _END_ 筆結果，共 _TOTAL_ 筆",
	"infoEmpty": "顯示第 0 至 0 筆結果，共 0 筆",
	"infoThousands": ",",
	"lengthMenu": "顯示 _MENU_ 筆結果",
	"search": "搜尋：",
	"searchPlaceholder": "請輸入關鍵字",
	"thousands": ",",
	"infoFiltered": "(從 _MAX_ 筆結果中篩選)"
};

const F = new Intl.NumberFormat(undefined, {
	'maximumFractionDigits': 2
});

function format(num) {
	if (num)
		return num.toString(); //return F.format(num);
	return '';
}
$('#SOL').DataTable({
	'data': SOL,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [3, 4, 5, 6],
		"render": format
	}]
});
$('#UL').DataTable({
	'data': UL,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [3, 4, 5, 6],
		"render": format
	}]
});
$('#ZL').DataTable({
	'data': ZL,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [3, 4, 5, 6],
		"render": format
	}]
});
$('#MONTHY').DataTable({
	'data': MONTHY,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [3, 4, 5, 6],
		"render": format
	}]
});
$('#STAR').DataTable({
	'data': STAR,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [2, 3, 4, 5],
		"render": format
	}]
});
$('#COLLAB').DataTable({
	'data': COLLAB,
	"bAutoWidth": false,
	'language': lang,
	"columnDefs": [{
		"targets": [3, 4, 5, 6],
		"render": format
	}],
	'rowGroup': {
		'dataSrc': 0
	}
});

